Documents/СоставлениеРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>СоставлениеРасписания</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасписаниеНаДату</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебныйПлан</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НагрузкаГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖурналЗаполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Семестр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Занятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкаУрока</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дисциплина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дисциплины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кабинет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кабинеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Преподаватель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кадры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РасписаниеНаДату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>РасписаниеНаДату</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дисциплина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дисциплины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Урок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаУрока</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кадры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СоставлениеРасписания/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр РасписаниеНаДату
	Движения.РасписаниеНаДату.Записывать = Истина;
	Для Каждого ТекСтрокаРасписание Из Расписание Цикл
		Движение = Движения.РасписаниеНаДату.Добавить();
		Движение.Период = Дата;
		Движение.Группа = Группа;
		Движение.Дисциплина = ТекСтрокаРасписание.Дисциплина;
		Движение.Урок = ТекСтрокаРасписание.Занятие;
		Движение.Дата = ДатаРасписания;
		Движение.Преподаватель = ТекСтрокаРасписание.Преподаватель;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры
